In [2]:
import numpy as np     #Andrade Alvarado Alberto Abraham
import pandas as pd

In [3]:
df = pd.DataFrame({
    'VarA' : ['aa', None, 'cc'], #Andrade Alvarado Alberto Abraham
    'VarB' : [20, 30, None],
    'VarC' : [1234, 3456, 6789]
    },
    index = ['Caso1','Caso2','Caso3']
)
df

       VarA  VarB  VarC
Caso1    aa  20.0  1234
Caso2  None  30.0  3456
Caso3    cc   NaN  6789

In [4]:
pd.isnull(df)      #Andrade Alvarado Alberto Abraham

        VarA   VarB   VarC
Caso1  False  False  False
Caso2   True  False  False
Caso3  False   True  False

In [5]:
df.dropna(subset=["VarA",'VarB'])        #Andrade Alvarado Alberto Abraham

      VarA  VarB  VarC
Caso1   aa  20.0  1234

In [6]:
df.fillna("")     #Andrade Alvarado Alberto Abraham

      VarA  VarB  VarC
Caso1   aa  20.0  1234
Caso2       30.0  3456
Caso3   cc        6789